/************************************************************************ *
*   File: constants.c                                   Part of CircleMUD *
*  Usage: Numeric and string contants used by the MUD                     *
*                                                                         *
*  All rights reserved.  See license.doc for complete information.        *
*                                                                         *
*  Copyright (C) 1993, 94 by the Trustees of the Johns Hopkins University *
*  CircleMUD is based on DikuMUD, Copyright (C) 1990, 1991.               *
************************************************************************ */

#include "sysdep.h"

#include "structs.h"
#include "spells.h"
#include "interpreter.h"        /* alias_data */
#include "constants.h"

const int debugz = 1;

int HORSE_VNUM = 5018;
int HORSE_COST = 50;

int START_SWORD = 102;
int START_CLUB  = 103;
int START_KNIFE = 101;
int START_SCROLL = 0;
int START_BOTTLE = 106;
int CREATE_LIGHT = 109;
int START_LIGHT = 107;
int START_BREAD = 108;
int START_ARMOR = 119;
int START_LEGS  = 120;
int START_ARMS  = 121; //
int START_FEET  = 122; //обувь
int START_SHIELD = 123;
int START_WRUNE = 223;
int START_ERUNE = 222;
int START_ARUNE = 225;
int START_FRUNE = 224;
int START_LUK   = 105;

/* strings corresponding to ordinals/bitvectors in structs.h ***********/


/* (Note: strings for class definitions in class.c instead of here) */



/* cardinal directions */
const char *dirs[] = {
//  "no direction",
    "north",
    "east",
    "south",
    "west",
    "up",
    "down",
    "\n"
};

const char *DirIs[] = {
//  "нет направления",
    "север",
    "восток",
    "юг",
    "запад",
    "вверх",
    "вниз",
    "\n"
};

const int rev_dir[] = { SOUTH, WEST, NORTH, EAST, DOWN, UP };

/* коэфф по уровням заклинаний */
const int koef_spell[] =   {
    1000, // уровня 0 BASIC
    666, // уровня 1 NOVICE
    500,  // уровня 2 SPEC
    333,  // уровня 3 MASTER
    111,  // уровня 4 PROFES
    55   // уровня 5 GRANDM
};

const int ExtraSkillValuesCol = 6;

const char *ExtraSkillNames[] = {
    "",
    "новичок",
    "специалист",
    "мастер",
    "эксперт",
    "гранд мастер"
};

const char *ExtraSkillNames2[] = {
    "",
    "новичка",
    "специалиста",
    "мастера",
    "эксперта",
    "гранд мастера"
};

const char *dig_messages[] = {
    "Здесь нельзя копать.", //0 inside
    "Вы начали рыть землю.", //1 city
    "Вы начали рыть землю.", //2 поле
    "Вы начали рыть землю.", //3 лес
    "Вы начали рыть землю.", //4 холмы
    "Вы начали долбить камни.", //5 скалы
    "Вы начали долбить камни.", //6 горы
    "Вы начали ощупывать руками дно.", //7 вода плавательная
    "Здесь нельзя копать.", //8 water
    "Здесь нельзя копать.", //9 air
    "Вы начали рыться в дне.", //10 underwater
    "Здесь нельзя копать.", //11 secret
    "\n", //12
    "\n", //13
    "\n", //14
    "\n", //15
    "\n", //16
    "\n", //17
    "\n", //18
    "\n", //19
    "Вы начали копаться в снегу.", //20 поле (снег)
    "Вы начали рыться в грязи.", //21 поле (грязь)
    "Вы начали копаться в снегу.", //22 холмы (снег)
    "Вы начали копаться в гязи.", //23 холмы (грязь)
    "Вы начали копаться в снегу.", //24 холмы (снег)
    "Вы начали копаться в гязи.", //25 холмы (грязь)
    "Вы начали копаться в снегу.", //26 скалы (снег)
    "Вы начали копаться в снегу.", //27 скалы (снег)
    "Здесь нельзя копать.", // 28 тонкий лед
    "Здесь нельзя копать.", //29 лед
    "Здесь нельзя копать.", //30 тостый лед
    "\n"
};

const char *blood_messages[] = {
    "Чья-та кровь осталась тут.",
    "Капельки крови на земле.",
    "Небольшая лужица крови на земле.",
    "Лужа крови на земле.",
    "Земля сильно забрызгана кровью.",
    "Вся земля залита кровью.",
    "Кровь и выдранное мясо лежат на земле.",
    "Земля забрызгана кровью и кишками.",
    "Кровь хлюпает у Вас под ногами.",
    "Море крови на полу и стенах.",
    "Вы просто плаваете в крови.",
    "\n"
};
const char *shot_types[] = {
    "лазер",
    "граната",
    "стрела",
    "пуля",
    "патрон",
    "ракета",
    "\n"
};
const int shot_damage[] =   {
    50,
    35,
    15,
    25,
    30,
    75,
    0
};


const int flee_koef[] = {
    100, //неизвестный
    65, //маг
    100, //воин
    50, //вор
    80, //охотник
    70,  //жрец
    65 //некромант
};

const char *imm_name[] = {
    "[ Герой ] ", //31
    "[ Младший Бог ] ", //32
    "[ Бог ] ", //33
    "[ Старший Бог ] ", //34
    "[ Верховный Бог ] ", //35
    "\n"
};

const char *DirsTo[] = {
    "на север",
    "на восток",
    "на юг",
    "на запад",
    "вверх",
    "вниз",
    "\n"
};

const char *DirsTo_2[] = {
    "на севере",
    "на востоке",
    "на юге",
    "на западе",
    "вверху",
    "внизу",
    "\n"
};

const char *DirsFrom[] = {
    "с юга",
    "с запада",
    "с севера",
    "с востока",
    "снизу",
    "сверху",
    "\n"
};


/* ROOM_x */
const char *room_bits[] = {
    "ТЕМНО",
    "ДТ",
    "!МОБЫ",
    "ПОМЕЩЕНИЕ",
    "МИРНАЯ",
    "ГЛУХАЯ",
    "НЕТ СЛЕДОВ",
    "НЕТ МАГИИ",
    "ТУННЕЛЬ",
    "ПРИВАТ",
    "БОГИ",
    "ЗАМОК",
    "ЗАМОК СЛОМАН",
    "ПЕЩЕРА",
    "OLC",
    "*",                          /* BFS MARK */
    "МАГИ",
    "ВОИНЫ",
    "ВОРЫ",
    "ОХОТНИКИ",
    "ТЕСНАЯ",
    "ЖРЕЦЫ",
    "БОЛОТО",
    "\n",
    "АРЕНА",
    "!ПРИЗВАТЬ",
    "!ПЕРЕМЕЩЕНИЕ",
    "!ЛОШАДЬ",
    "!ПОГОДА",
    "МЕДЛЕНЫЙ ДТ",
    "ЛЕДЯНОЙ ДТ",
    "ЛЕТАЮЩИЙ ДТ",
    "СВАЛКА",
    "!ЛЮДИ",
    "!ОРКИ",
    "!ГНОМЫ",
    "!ЭЛЬФЫ",
    "!ПЭЛЬФЫ",
    "!БАРИАУРЫ",
    "!ТИФЛИНГИ",
    "!ЭЙЗИМАРЫ",
    "\n",
    "\n",
    "\n"
};

/* EX_x */
const char *exit_bits[] = {
    "есть дверь",
    "закрыта",
    "заперта",
    "не взломать",
    "скрыто",
    "\n"
};


/* SECT_ */
const char *sector_types[] = { "ВНУТРИ",
                               "УЛИЦА",
                               "ПОЛЕ",
                               "ЛЕС",
                               "ХОЛМЫ",
                               "ГОРЫ",
                               "ВЫСОКИЕ ГОРЫ",
                               "МЕЛКОВОДЬЕ",
                               "ВОДА",
                               "ВОЗДУХ",
                               "ПОДВОДОЙ",
                               "СЛУЖЕБНАЯ",
                               "\n",
                               "\n",
                               "\n"

                             };


/*
 * SEX_x
 * Not used in sprinttype() so no \n.
 */
const char *genders[] = { "бесполое",
                          "мужчина",
                          "женщина",
                          "многоголовый",
                          "\n"
                        };

/* таблица коэф экспы в зависимости от алигнмента */
const int exp_align[ALIGN_NUM][ALIGN_NUM] = { /*GA    G   GN  NG  NN  NE  EN  E   EA  */
    {   1,   4,   6,  8, 10, 11, 11, 12, 13}, //GA
    {   4,   6,   6,  8, 10, 11, 11, 11, 12}, //G
    {   6,   8,   8,  8, 10, 10, 11, 11, 12}, //GN
    {   8,   8,   8, 10, 10, 10, 10, 11, 11}, //NG
    {  10,  10,  10, 10, 10, 10, 10, 10, 10}, //NN
    {  11,  11,  10, 10, 10, 10,  8,  8,  8}, //NE
    {  12,  11,  11, 10, 10,  8,  8,  8,  6}, //EN
    {  12,  11,  11, 11, 10,  8,  6,  6,  4}, //E
    {  13,  12,  11, 11, 10,  8,  6,  4,  1}  //EA
};

float change_align[ALIGN_NUM][ALIGN_NUM] = {
    /*         GA     G    GN    NG    N     NE    EN    E     EA  */
    /* GA */ {0.02, 0.06, 0.08, 0.06, 0.01, 0.05, 0.60, 0.80, 1.00 },
    /* G  */ {0.04, 0.08, 0.10, 0.05, 0.01, 0.05, 0.60, 0.70, 0.80 },
    /* GN */ {0.06, 0.10, 0.15, 0.05, 0.01, 0.04, 0.50, 0.55, 0.60 },

    /* NG */ {0.10, 0.10, 0.10, 0.05, 0.01, 0.05, 0.10, 0.10, 0.10 },
    /* N  */ {0.10, 0.08, 0.05, 0.05, 0.01, 0.05, 0.05, 0.08, 0.10 },
    /* NE */ {0.10, 0.10, 0.10, 0.05, 0.01, 0.05, 0.10, 0.10, 0.10 },

    /* EN */ {0.60, 0.55, 0.50, 0.04, 0.01, 0.05, 0.10, 0.08, 0.05 },
    /* E  */ {0.80, 0.70, 0.60, 0.05, 0.01, 0.05, 0.10, 0.06, 0.02 },
    /* EA */ {1.00, 0.80, 0.60, 0.05, 0.01, 0.06, 0.08, 0.05, 0.01 }
};

const int eyes_race_evil[NUM_RACES][NUM_EYES] = {
//               Чрн Жел Кра Зел Сер Син Гол Кор Сер Зол
    /* Человек */    {0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0},
    /* Орк     */    {0,  1,  2,  3,  0,  0,  0,  0,  0,  0,  0},
    /* Гном    */    {0,  1,  0,  3,  0,  0,  0,  0,  0,  0,  0},
    /* Эльф    */    {0,  1,  0,  3,  0,  0,  0,  0,  0,  0,  0},
    /* Полуэльф*/    {0,  1,  0,  3,  0,  0,  0,  0,  0,  0,  0},
    /* Бариаур */    {0,  1,  0,  3,  0,  0,  0,  0,  0,  0,  0},
    /* Тифлинг */    {0,  1,  2,  3,  0,  0,  0,  0,  0,  0,  0},
    /* Эйзимар */    {0,  1,  0,  0,  0,  0,  0,  0,  0,  0,  0},
    /* Дроу */       {0,  1,  2,  3,  4,  0,  0,  7,  0,  9,  0},
};

const int eyes_race_neut[NUM_RACES][NUM_EYES] = {
//               Чрн Жел Кра Зел Сер Син Гол Кор Сер Зол
    /* Человек */ {0,  0,  0,  0,  4,  5,  0,  0,  8,  0,  0},
    /* Орк     */ {0,  0,  0,  0,  4,  5,  0,  0,  8,  0,  0},
    /* Гном    */ {0,  0,  0,  0,  0,  0,  0,  0,  8,  0,  0},
    /* Эльф    */ {0,  0,  0,  0,  4,  5,  0,  7,  0,  0,  0},
    /* Полуэльф*/ {0,  0,  0,  0,  4,  5,  6,  7,  8,  0,  0},
    /* Бариаур */ {0,  0,  0,  0,  0,  0,  0,  0,  8,  0,  0},
    /* Тифлинг */ {0,  0,  0,  0,  4,  5,  0,  0,  8,  0,  0},
    /* Эйзимар */ {0,  0,  0,  0,  4,  5,  6,  7,  8,  0,  0},
    /* Дроу */    {0,  1,  2,  3,  4,  0,  0,  7,  0,  9,  0},
};

const int eyes_race_good[NUM_RACES][NUM_EYES] = {//                1   2   3   4   5   6   7   8   9  10
//               Чрн Жел Кра Зел Сер Син Гол Кор Сер Зол
    /* Человек */ {0,  0,  0,  0,  0,  5,  6,  7,  0,  0,  0},
    /* Орк     */ {0,  0,  0,  0,  0,  5,  0,  0,  8,  9,  0},
    /* Гном    */ {0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  10},
    /* Эльф    */ {0,  0,  0,  0,  0,  0,  0,  0,  0,  9,  10},
    /* Полуэльф*/ {0,  0,  0,  0,  0,  0,  6,  7,  0,  9,  10},
    /* Бариаур */ {0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  10},
    /* Тифлинг */ {0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  10},
    /* Эйзимар */ {0,  0,  0,  0,  0,  0,  0,  0,  0,  9,  10},
    /* Дроу */    {0,  1,  2,  3,  4,  0,  0,  7,  0,  9,  0},
};

const char *race_name[NUM_RACES][NUM_SEXES] = { {"люди", "мужчина", "женщина", "люди"}, //0
    {"орки", "орк", "оркна", "орк"},
    {"гномы", "гном", "гномелла", "гномы"},
    {"эльфы", "эльф", "эльфийка", "эльфы"},
    {"полуэльфы", "полуэльф", "полуэльфийка", "полуэльфы"},
    {"бариауры", "бариаур", "бариэлла", "бариауры"}, //5
    {"тифлинги", "тифлинг", "тифлина", "тифлинги"},
    {"эйзимары", "эйзимар", "эйзимина", "эйзимары"},
    {"дроу", "дроу", "дроу", "дроу"},
    {"животное", "животное", "животное", "животные"},
    {"драконы", "дракон", "драконша", "драконы"},
    {"гуманоиды", "гуманоид", "гуманоид", "гуманоиды"}, //10
    {"генэйзи", "генэйзи", "генэйзи", "генэйзи"},
    {"птицо", "птица", "птица", "птицы"},
    {"червь", "червь", "червь", "червь"},
    {"рептилия", "рептилия", "рептилия", "рептилия"},
    {"змея", "змея", "змея", "змея"},                    //15
    {"насекомое", "насекомое", "насекомое", "насекомое"},
    {"гигант", "гигант", "гигант", "гигант"},
    {"конструкция", "конструкция", "конструкция", "конструкция"},
    {"призрак", "призрак", "призрак", "призрак"},
    {"растение", "растение", "растение", "растение"},        //20
    {"слизь", "слизь", "слизь", "слизь"},
    {"рыба", "рыба", "рыба", "рыба"},
    {"монстр", "монстр", "монстр", "монстр"},
    {"гитцы", "гитц", "гитц", "гитц"},
    {"скелеты", "скелет", "скелет", "скелет"},
    {"слаады", "слаад", "слаад", "слаад"},
    {"аберрации", "аберрация", "аберрация", "аберрация"},
    {"феи", "фея", "фея", "фея"},
    {"элементалы", "элементал", "элементал", "элементал"},
    {"предметы", "предмет", "предмет", "предмет"},
    {"мефиты", "мефит", "мефит", "мефит"},
    {"скакуны", "скакун", "скакун", "скакун"},
    {"грызун", "грызун", "грызун", "грызун"}
};

const char *race_name_pad_male[] = {
    "мужчин(а)", "орк()", "гном()", "эльф()", "полуэльф()", "бариаур()",
    "тифлинг()", "эйзимар()", "дроу", "животн(ое)", "дракон()", "гуманоид()",
    "джинази", "птиц(а)", "черв(ь)", "рептил(ия)", "зм(ея)", "насеком(ое)",
    "гигант()", "конструкц(ия)", "призрак()", "растен(ие)", "слиз(ь,и,и,ь,ью,е)",
    "рыб(а)", "монстр()", "гитц()", "скелет()", "слаад()", "аберрац(ия)",
    "фе(я)", "элементал()", "предмет()", "мефит()", "скакун()", "грызун()"
};

const char *race_name_pad_female[] = { /*  кто       нет кого  дать кому  убит кого  с кем       о ком */
    "женщин(а)", "оркн(а)", "гномелл(а)", "эльфий(ка)", "полуэльфий(ка)", "бариелл(а)",
    "тифлин(а)", "эйзимин(а)", "дроу", "животн(ое)", "дракон()", "гуманоид()",
    "джинази", "птиц(а)", "черв(ь)", "рептил(ия)", "зм(ея)", "насеком(ое)",
    "гигант()", "конструкц(ия)", "призрак()", "растен(ие)", "слиз(ь,и,и,ь,ью,е)",
    "рыб(а)", "монстр()", "гитцьен(а)", "скелет()", "слаад()", "аберрац(ия)",
    "фе(я)", "элементал()", "предмет()", "мефит()", "скакун()", "грызун()"
};

// специализации
const char *class_abbrevs[] = {
    "Нет",
    "Маг",
    "Вои",
    "Плт",
    "Охт",
    "Жрц",
    "Нек",
    "\n"
};


const char *class_name[] = {
    "неизвестный", //0
    "маг", //1
    "воин",
    "плут",
    "охотник",
    "жрец",
    "некромант",        //6
    "",
    "",
    "",
    "",
    "монстр",
    "\n"
};

const char *gods_name[] = {
    "Атеист",
    "Пелор",
    "Элонна",
    "Коррэллион Ларэтиэн",
    "Фарлангун",
    "Оллидамарах",
    "Святой Губерт",
    "Груумш",
    "Нерулл",
    "Гекстор"
};

const char *gods_name_2[] = {
    "Атеист",
    "Пелору",
    "Элонне",
    "Коррэллион Ларэтиэну",
    "Фарлангуну",
    "Оллидамараху",
    "Святому Губерту",
    "Груумшу",
    "Неруллу",
    "Гекстору"
};

const char *align_name[] = {
    "абсолютно добрый",
    "добрый",
    "добро-нейтральный",
    "нейтрально-добрый",
    "нейтральный",
    "нейтрально-злой",
    "злой-нейтральный",
    "злой",
    "абсолютно злой"
};


/* POS_x */
const char *position_types[] = { "МЕРТ",
                                 "УМИРАЕТ",
                                 "БЕЗ СОЗНАНИЯ",
                                 "ОБМОРОК",
                                 "СПИТ",
                                 "ОТДЫХАЕТ",
                                 "СИДИТ",
                                 "СРАЖАЕТСЯ",
                                 "СТОИТ",
                                 "ЛЕТАЕТ",
                                 "\n"
                               };
const char *position_types_sml[] = { "мертвый",
                                     "умирает",
                                     "без сознания",
                                     "обморок",
                                     "спит",
                                     "отдыхает",
                                     "сидит",
                                     "сражается",
                                     "стоит",
                                     "летает",
                                     "\n"
                                   };


/* PLR_x */
const char *player_bits[] = {
    "убийца",
    "вор",
    "заморожен",
    "DONTSET",
    "пишет",
    "отправляет письмо",
    "CSH",
    "SITEOK",
    "крики запрещены",
    "титул запрещен",
    "!УДАЛЕН!",
    "есть точка входа",
    "!WIZL",
    "не может быть удален",
    "INVST",
    "CRYO",
    "в аду",
    "зарегистрирован",
    "молчит",
    "удален",
    "free",
    "мульт",
    "\n",
    "\n",
    "\n",
    "\n"
};


/* MOB_x */
const char *action_bits[] = { "спец",
                              "!ходит",
                              "подбирает",
                              "моб",
                              "!заколоть",
                              "агрессивен",
                              "зона",
                              "трус",
                              "агр.днем",
                              "агр.ночью",
                              "путешественик",
                              "помнит",
                              "помогает",
                              "!очар",
                              "!призывать",
                              "!усыпить",
                              "!сбить",
                              "!ослепить",
                              "скакун",
                              "!оцепенить",
                              "!умолчать",
                              "агр.христиане",
                              "агр.язычники",
                              "!страх",
                              "!групится",
                              "поднят",
                              "лутер",
                              "!убить",
                              "удален",
                              "очищен",
                              "\n",
                              "плавает",
                              "летает",
                              "только в воде",
                              "*",
                              "*",
                              "*",
                              "*",
                              "появл.днем",
                              "появл.ночью",
                              "появл.полнолуние",
                              "появл.зимой",
                              "появл.весной",
                              "появл.летом",
                              "появл.осенью",
                              "!сражается",
                              "снижение экстраатак",
                              "орда",
                              "клон",
                              "ангел",
                              "демон",
                              "левитирует",
                              "\n",
                              "огненное дыхание",
                              "зловонное дыхание",
                              "ледяное дыхание",
                              "кислотное дыхание",
                              "ослепляющее дыхание",
                              "охраник",
                              "ксеноморф",
                              "умный моб",
                              "рента-моб",
                              "почтальон",
                              "банкир",
                              "учитель",
                              "мастер",
                              "\n",
                              "\n",
                              "\n",
                              "\n"

                            };


const char *function_bits[] = { "!север", //0
                                "!восток",
                                "!юг",
                                "!запад",
                                "!вверх",
                                "!вниз",
                                "травит",
                                "невидим",
                                "подкрадывается",
                                "маскируется",
                                "*",  //10
                                "прилетает",
                                "приползает",
                                "прискакивает",
                                "приплывает",
                                "прибегает",  //15
                                "*",
                                "*",
                                "*",
                                "*",
                                "святой",  //20
                                "нечистый",
                                "выносливый",
                                "заболевший",
                                "помощник",
                                "одинокий",
                                "предмет",     //26
                                "*",
                                "репоп",
                                "*",
                                "\n",
                                "ворует",
                                "вооружается",
                                "одевается",
                                "держит свет",
                                "мститель",
                                "чума",
                                "\n",
                                "\n",
                                "\n"
                              };



/* PRF_x */
const char *preference_bits[] = { "краткий",
                                  "компактный",
                                  "глух",
                                  "!обратиться",
                                  "п.жизни",
                                  "п.запоминания",
                                  "п.энергии",
                                  "автовыходы",
                                  "!напасть",
                                  "КВЕСТ",
                                  "призываем",
                                  "!дублировать",
                                  "всевидение",
                                  "цвет 1",
                                  "цвет 2",
                                  "!иммканал",
                                  "лог 1",
                                  "лог 2",
                                  "!аукцион",
                                  "!крики",
                                  "!поздравления",
                                  "флаги комнат",
                                  "п.опыта",
                                  "п.выходов",
                                  "п.упрвня",
                                  "п.денег",
                                  "п.тика",
                                  "точный Стиль",
                                  "осторожный Стиль",
                                  "тестер",
                                  "\n",
                                  "zlib",         /* 0 */
                                  "автозаучивание",
                                  "не кричать",
                                  "автоформат",
                                  "советы",
                                  "грп.мобы",
                                  "грп.объекты",
                                  "экипировка",
                                  "посчитан",
                                  "пок.боя",
                                  "окр.1000",   /* 10 */
                                  "окр.100000",
                                  "протокол",
                                  "!следовать",
                                  "!брать",
                                  "следопыт",
                                  "сменацвета",
                                  "опытный",
                                  "\n",
                                  "\n",
                                  "\n"
                                };



/* AFF_x */
const char *affected_bits[] = { "слепота",                    /* 0 */
                                "невидимость",
                                "определение наклонностей",
                                "определение невидимости",
                                "определение магии",
                                "чувствовать жизнь",
                                "хождение по воде",
                                "освящение",
                                "состоит в группе",
                                "проклятие",
                                "инфравидение",                /* 10 */
                                "яд",
                                "защита от тьмы",
                                "защита от света",
                                "магический сон",
                                "нельзя выследить",
                                "привязан",
                                "пусто",
                                "подкрадывается",
                                "прячется",
                                "ярость",                     /* 20 */
                                "зачарован",
                                "обездвижен",
                                "летит",
                                "молчание",
                                "настороженность",
                                "мигание",
                                "верхом или под седлом",
                                "не сбежит",
                                "свет",
                                "\n",      /* 30 */
                                "освещение",                 /* 0 */
                                "затемнение",
                                "определение яда",
                                "под мухой",
                                "отходняк",
                                "!правая рука",
                                "!левая рука",
                                "!битва",
                                "кровотечение",
                                "маскировка",
                                "дышать водой",
                                "торможение",
                                "ускорение",
                                "костяная стена",
                                "огненная корона",
                                "огненный щит",
                                "чума",
                                "медитирует",
                                "перевязан",
                                "каменная рука",
                                "костяные шипы",    /*20*/
                                "нанят",
                                "силы зла",
                                "святая аура",
                                "пусто[слж]",
                                "ледяная аура",
                                "каменная кожа",
                                "каменная аура",
                                "видение",      /*28 */
                                "ночное зрение",
                                "\n",      /* 30 */
                                "стена лезвий",
                                "глухой",
                                "лучи света",
                                "купленая лошадь",
                                "защита от нежити",
                                "левитация",
                                "болезнь",
                                "вживление",
                                "как нежить",
                                "ритуал",
                                "\n",
                                "\n",
                                "\n",
                                "\n"
                              };

/* CON_x */
const char *connected_types[] = { "В игре",
                                  "Disconnecting",
                                  "Get name",
                                  "Confirm name",
                                  "Get password",
                                  "Get new PW",
                                  "Confirm new PW",
                                  "Select sex",
                                  "Select class",
                                  "Reading MOTD",
                                  "Main Menu",
                                  "Get descript.",
                                  "Changing PW 1",
                                  "Changing PW 2",
                                  "Changing PW 3",
                                  "Self-Delete 1",
                                  "Self-Delete 2",
                                  "Disconnecting",
                                  "Object edit",
                                  "Room edit",
                                  "Zone edit",
                                  "Mobile edit",
                                  "Shop edit",
                                  "Trigger edit",
                                  "Get name2",
                                  "Get name3",
                                  "Get name4",
                                  "Get name5",
                                  "Get name6",
                                  "Select religion",
                                  "Select race",
                                  "Select lows",
                                  "Select keytable",
                                  "Get email",
                                  "",
                                  "",
                                  "Generation",
                                  "Подтверждает имя",
                                  "Выбирает натуру",
                                  "Выбирает темплейт",
                                  "Запрашивает н.пароль",
                                  "Подтвержает н.пароль",
                                  "\n"
                                };


const int wear_order_index[NUM_WEARS] = {
    WEAR_LIGHT,
    WEAR_HEAD,
    WEAR_EAR_R,
    WEAR_EAR_L,
    WEAR_FACE,
    WEAR_NECK_1,
    WEAR_NECK_2,
    WEAR_BODY,
    WEAR_WAIST,
    WEAR_QUIVER,
    WEAR_ABOUT,
    WEAR_ARMS,
    WEAR_HANDS,
    WEAR_WRIST_R,
    WEAR_WRIST_L,
    WEAR_FINGER_R,
    WEAR_FINGER_L,
    WEAR_LEGS,
    WEAR_FEET,
    WEAR_TAIL,
    WEAR_WIELD,
    WEAR_BOTHS,
    WEAR_SHIELD,
    WEAR_HOLD
};

/*
 * WEAR_x - for eq list
 * Not use in sprinttype() so no \n.
 */
const char *where[] = { "<как свет>",
                        "<палец правой руки>",
                        "<палец левой руки>",
                        "<на лице>",
                        "<в левом ухе>",
                        "<в правом ухе>",
                        "<на шее>",
                        "<на груди>",
                        "<на теле>",
                        "<на голове>",
                        "<на ногах>",
                        "<как обувь>",
                        "<на кистях>",
                        "<на руках>",
                        "<щит>",
                        "<вокруг тела>",
                        "<на поясе>",
                        "<на правом запястье>",
                        "<на левом запястье>",
                        "<в правой руке>",
                        "<в левой руке>",
                        "<в руках>",
                        "<на хвосте>",
                        "<за спиной>"
                      };

const char *where_tatoo[] = { "<как свет>",
                              "<палец правой руки>",
                              "<палец левой руки>",
                              "<на щеке>",
                              "<в левом ухе>",
                              "<в правом ухе>",
                              "<на шее>",
                              "<на груди>",
                              "<на груди>",
                              "<на голове>",
                              "<на бедре>",
                              "<на икрах>",
                              "<на плече>",
                              "<на ладонях>",
                              "<щит>",
                              "<на спине>",
                              "<на поясе>",
                              "<на правом запястье>",
                              "<на левом запястье>",
                              "<в правой руке>",
                              "<в левой руке>",
                              "<в руках>",
                              "<на хвосте>",
                              "<за спиной>"
                            };

/* WEAR_x - for stat */
const char *equipment_types[] = { "Использует для освещения       ",
                                  "Надето на правый большой палец ",
                                  "Надето на левый большой палец  ",
                                  "Надето на лицо                 ",
                                  "Надето на правое ухо           ",
                                  "Надето на левое ухо            ",
                                  "Намотано на шею                ",
                                  "Болтается на груди             ",
                                  "Надето на тело                 ",
                                  "Надето на голову               ",
                                  "Надето на ноги                 ",
                                  "Обут                           ",
                                  "На кистях                      ",
                                  "Надето на руки                 ",
                                  "В качестве щита                ",
                                  "Наброшено на тело              ",
                                  "Надето на пояс                 ",
                                  "На правом запястье             ",
                                  "На левом запястье              ",
                                  "Сжимает в правой руке          ",
                                  "Держит в левой руке            ",
                                  "Держит в руках                 ",
                                  "Надето на хвост                ",
                                  "Надето за спиной               ",
                                  "\n"
                                };


/* ITEM_x (ordinal object types) */
const char *item_types[] = { "UNDEFINED",
                             "СВЕТ",
                             "СВИТОК",
                             "ПАЛОЧКА",
                             "ЖЕЗЛ",
                             "ОРУЖИЕ",
                             "ОГНЕВОЕ ОРУЖИЕ",
                             "РАКЕТА",
                             "ДРАГОЦЕННОСТЬ",
                             "БРОНЯ",
                             "НАПИТОК",
                             "ОДЕЖДА",
                             "ДРУГОЕ",
                             "ИНСТРУМЕНТ",
                             "КАПКАН",
                             "КОНТЕЙНЕР",
                             "БУМАГА",
                             "ЕМКОСТЬ",
                             "КЛЮЧ",
                             "ЕДА",
                             "ДЕНЬГИ",
                             "ПЕРО",
                             "ЛОДКА",
                             "ИСТОЧНИК",
                             "МАГИЧЕСКАЯ КНИГА",
                             "МАГИЧЕСКИЙ ИНГРАДИЕНТ",
                             "ФУРНИТУРА",
                             "ТРУП",
                             "ТАТУИРОВКА",
                             "ДОСКА",
                             "КНИГА",
                             "КАРЕТА",
                             "ЭЛЕМЕНТ",
                             "ШАХТА",
                             "ОБЛОМОК",
                             "ЧЕРЕП",
                             "ЖУРНАЛ",
                             "СЦЕНАРИЙ",
                             "\n",
                             "\n"
                           };

const char *item_types_stat[] = { "Неизвестный",
                                  "Свет",
                                  "Магический свиток",
                                  "Магическая палочка",
                                  "Жезл",
                                  "Оружие",
                                  "Огнестрельное оружие",
                                  "Патрон",
                                  "Драгоценность",
                                  "Броня",
                                  "Магический напиток",
                                  "Одежда",
                                  "Другое",
                                  "TRASH",
                                  "Мусор",
                                  "Контейнер",
                                  "Записка",
                                  "Сосуд",
                                  "Ключ",
                                  "Еда",
                                  "Деньги",
                                  "Пишуший прибор",
                                  "Лодка",
                                  "Фонтан",
                                  "Магическая книга",
                                  "МАГИЧЕСКИЙ ИНГРАДИЕНТ",
                                  "Фурнитура",
                                  "Труп",
                                  "Татуировка",
                                  "Доска обьявлений",
                                  "Художественная литература",
                                  "Транспортное средство",
                                  "\n",
                                  "\n",
                                  "\n"
                                };

const char *ingradient_bits[] = { "руна",
                                  "огр.применение",
                                  "огр.повтор",
                                  "огр.уровня",
                                  "рассыпется",
                                  "\n"
                                };

/* ITEM_WEAR_ (wear bitvector) */
const char *wear_bits[] = { "ВЗЯТЬ",
                            "ПАЛЬЦЫ",
                            "ШЕЯ/ГРУДЬ",
                            "ТЕЛО",
                            "ГОЛОВА",
                            "НОГИ",
                            "ОБУВЬ",
                            "РУКИ",
                            "КИСТИ",
                            "ЩИТ",
                            "ПЛЕЧИ",
                            "ПОЯС",
                            "ЗАПЯСТЬЕ",
                            "ПРАВАЯ.РУКА",
                            "ЛЕВАЯ.РУКА",
                            "ОБЕ.РУКИ",
                            "ЛИЦО",
                            "ХВОСТ",
                            "УШИ",
                            "\n"
                          };


/* ITEM_x (extra bits) */
const char *extra_bits[] = { "светится",
                             "шумит",
                             "!рента",
                             "!пожертвовать",
                             "!невидим",
                             "невидим",
                             "магический",
                             "!бросить",
                             "благословлен",
                             "!продать",
                             "рассыпется",  //10
                             "рассыпется вне зоны",
                             "!обезоружить",
                             "!рассыпется",
                             "отравлен",
                             "заточен",
                             "укреплен",
                             "появиться днем",
                             "появится ночью",
                             "в полнолуние",
                             "появится зимой",
                             "появится весной",
                             "появится летом",
                             "аура смерти",
                             "плавает",
                             "летает",
                             "можно метнуть",
                             "таймер запущен",
                             "горит", // 28
                             "закопан",
                             "\n",  //30
                             "инкогнито",
                             "скрытый",
                             "внешнний",
                             "спрятан",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n",
                             "\n"
                           };


// ITEM_NO_
const char *no_bits[] = { "!ДОБРЫЕ",
                          "!ЗЛЫЕ",
                          "!НЕЙТРАЛЬНЫЕ",
                          "!МАГИ",
                          "!ВОИНЫ",
                          "!ВОРЫ",
                          "!ОХОТНИКИ",
                          "!ЛЮДИ",
                          "!ОРКИ",
                          "!ГНОМЫ",
                          "!ЭЛЬФЫ",
                          "!ПОЛУЭЛЬФЫ",
                          "!БАРИАУРЫ",
                          "!ТИФЛИНГИ",
                          "!ААЗИАМАРЫ",
                          "!ЖИВОТНЫЕ",
                          "!ДРАКОНЫ",
                          "!ГУМАНОИДЫ",
                          "!ДУХИ",
                          "\n",
                          "\n",
                          "\n",
                          "\n",
                          "\n"
                        };


// ITEM_ANTI
const char *anti_bits[] = { "!ДОБРЫЕ",
                            "!ЗЛЫЕ",
                            "!НЕЙТРАЛЬНЫЕ",
                            "!МАГИ",
                            "!ВОИНЫ",
                            "!ВОРЫ",
                            "!ОХОТНИКИ",
                            "!ЛЮДИ",
                            "!ОРКИ",
                            "!ГНОМЫ",
                            "!ЭЛЬФЫ",
                            "!ПОЛУЭЛЬФЫ",
                            "!БАРИАУРЫ",
                            "!ТИФЛИНГИ",
                            "!ААЗИАМАРЫ",
                            "!ЖИВОТНЫЕ",
                            "!ДРАКОНЫ",
                            "!ГУМАНОИДЫ",
                            "!ДУХИ",
                            "\n",
                            "\n",
                            "\n"
                          };

// ITEM_NO для опознания
const char *no_bits_stat[] = { "добрых",
                               "злых",
                               "нейтральных",
                               "магов",
                               "воинов",
                               "воров",
                               "охотников",
                               "людей",
                               "орков",
                               "гномов",
                               "эльфов",
                               "полуэльфов",
                               "бариауров",
                               "тифлингов",
                               "эйзимаров",
                               "животных",
                               "драконов",
                               "гуманоидов",
                               "духов",
                               "\n",
                               "\n",
                               "\n"
                             };

// ITEM_ANTI для опознания
const char *anti_bits_stat[] = { "добрых",
                                 "злых",
                                 "нейтральных",
                                 "магов",
                                 "воинов",
                                 "воров",
                                 "охотников",
                                 "людей",
                                 "орков",
                                 "гномов",
                                 "эльфов",
                                 "полуэльфов",
                                 "бариауров",
                                 "тифлингов",
                                 "эйзимаров",
                                 "животных",
                                 "драконов",
                                 "гуманоидов",
                                 "духов",
                                 "\n",
                                 "\n",
                                 "\n"
                               };



/* APPLY_x */
const char *apply_types[] = { "ничего",
                              "сила",
                              "ловкость",
                              "интеллект",
                              "мудрость",
                              "телосложение",
                              "обаяние",
                              "профессия",
                              "уровень",
                              "возраст",
                              "вес", /* 10 */
                              "рост",
                              "макс. мана",
                              "макс. жизнь",
                              "макс. энергия",
                              "деньги",
                              "опыт",
                              "класс защиты", //17
                              "попадание",
                              "повреждения",
                              "удача", /* 20 */
                              "восст.маны",
                              "защита от отравления",
                              "защита от умений",
                              "!",
                              "восст.жизни",
                              "восст.энергии",
                              "слот.1",
                              "защита от хаоса",
                              "защита от порядка",
                              "слот.4", /* 30 */
                              "слот.5",
                              "слот.6",
                              "слот.7",
                              "слот.8",
                              "слот.9",
                              "размер",
                              "броня режущее",
                              "отравлено",
                              "защита от боевых умений",
                              "успех колдовства", /* 40 */
                              "мораль",
                              "скорость",
                              "запоминание",
                              "поглощение",
                              "рефлекс",
                              "выносливость",
                              "воля",
                              "защита от огня",
                              "защита от холода",
                              "защита от электричества",                   /* 50 */
                              "защита от кислоты",
                              "защита от негатива",
                              "защита от позитива",
                              "броня колющее",
                              "броня ударное",    /* 55 */
                              "увеличение исцеления",
                              "увеличение вреда от стихий",
                              "увеличение вреда от огня",
                              "увеличение вреда от холода",
                              "увеличение вреда от электричества",  /* 60 */
                              "увеличение вреда от кислоты",
                              "увеличение вреда от негатива",
                              "увеличение вреда от позитива",
                              "неизвестно1",
                              "неизвестно2",
                              "неизвестно3",
                              "\n"
                            };

// MAT_
const char *material_name [] = { "NO",
                                 "МЕДЬ",
                                 "БРОНЗА",
                                 "ЖЕЛЕЗО",
                                 "СТАЛЬ",
                                 "СЕРЕБРО", // 5
                                 "ЗОЛОТО",
                                 "ПЛАТИНА",
                                 "ТИТАН",
                                 "АДАМАНТИТ",
                                 "МИФРИЛ", // 10
                                 "ПЛАСТИК",
                                 "КРИСТАЛ",
                                 "ДЕРЕВО",
                                 "ПРОЧНОЕ ДЕРЕВО",
                                 "ФАРФОР", // 15
                                 "СТЕКЛО",
                                 "КАМЕНЬ",
                                 "КУСОК СКАЛЫ",
                                 "КОЖА",
                                 "ОРГАНИКА", // 20
                                 "КЕРАМИКА",
                                 "ТКАНЬ",
                                 "БУМАГА",
                                 "КОСТЬ",
                                 "ГАЗ",
                                 "ДРАГОЦЕННЫЙ КАМЕНЬ",
                                 "МЕТАЛЛ",
                                 "ПЕРГАМЕНТ",
                                 "\n"
                               };

const char *tatoo_color [] = { "нет",
                               "ораньжевыми",
                               "коричневыми",
                               "ржавыми",
                               "серыми",
                               "серебрянными", // 5
                               "золотыми",
                               "желтыми",
                               "синими",
                               "красными",
                               "зелеными", // 10
                               "фиолетовыми",
                               "голубыми",
                               "темными",
                               "черными",
                               "белыми", // 15
                               "бесцветными",
                               "темно-зелеными",
                               "темно-синими",
                               "темно-красными",
                               "нет", // 20
                               "нет",
                               "нет",
                               "нет",
                               "нет",
                               "нет",
                               "нет",
                               "нет",
                               "нет",
                               "\n"
                             };

const int material_value [] = { 50,
                          50,
                          60,
                          65,
                          90,
                          85,
                          80,
                          95,
                          90,
                          105,
                          100,
                          40,
                          25,
                          45,
                          65,
                          20,
                          15,
                          80,
                          70,
                          50,
                          40,
                          30,
                          35,
                          10,
                          60,
                          100,
                          90,
                          55,
                          5
                        };



/* CONT_x */
const char *container_bits[] = { "CLOSEABLE",
                                 "PICKPROOF",
                                 "CLOSED",
                                 "LOCKED",
                                 "\n",
                               };


/* LIQ_x */
const char *drinks[] = { "воды",
                         "пива",
                         "вина",
                         "эля",
                         "кваса",
                         "самогона",
                         "морсу",
                         "водки",
                         "браги",
                         "меду",
                         "молока",
                         "чаю",
                         "кофею",
                         "&RКРОВИ&n",
                         "соленой воды",
                         "родниковой воды",
                         "\n"
                       };


/* other constants for liquids ******************************************/


/* one-word alias for each drink */
const char *drinknames[] = { "вод(а)",
                             "пив(о)",
                             "вин(о)",
                             "эл(ь)",
                             "квас()",
                             "самогон()",
                             "морс()",
                             "вод(ка)",
                             "бра(га)",
                             "мед()",
                             "молоко",
                             "ча(й)",
                             "кофе",
                             "кро(вь,ви,ви, вь, вью,ви)",
                             "солен(ая) вод(а)",
                             "родников(ая) вод(а)",
                             "\n"
                           };


/* effect of drinks on DRUNK, FULL, THIRST -- see values.doc */
int drink_aff[][3] = { {0,  10, 90}, // вода
    {15, 20, 50},  // пиво
    {25, 20, 40},  // вино
    {30, 10, 40},  // эль
    {10, 20, 50},  // квас
    {60, 10, 40},  // самогон
    {00, 10, 80},  // морс
    {40, 20, 20}, // водка
    {30, 30, 30},  // брага
    {00, 80, -10}, // мед
    {00, 30, 60},  // молоко
    {00, 15, 90},  // чай
    {00, 15, 85},  // кофе
    {00, 50, -15}, // кровь
    {00, 10, -20}, // соленая вода
    {00, 15, 100} // родниковая вода
};


/* color of the various drinks */
const char *color_liquid[] = { "прозрачной",
                               "коричневой",
                               "бордовой",
                               "зеленоватой",
                               "бурой",
                               "прозрачной",
                               "рубиновой",
                               "зеленой",
                               "чистой",
                               "светло зеленой",
                               "белой",
                               "коричневой",
                               "темно-коричневой",
                               "красной",
                               "прозрачной",
                               "кристально чистой",
                               "\n"
                             };


/*
 * level of fullness for drink containers
 * Not used in sprinttype() so no \n.
 */
const char *fullness[] = { "меньше, чем наполовину",
                           "примерно наполовину",
                           "больше, чем наполовину",
                           "до краев"
                         };


struct extra_affects_type MageAffects[] = {{ -1, -1}};
struct obj_affected_type MageModifiers[] = {{ -1, -1}};
struct extra_affects_type WarriorAffects[] = {{ -1, -1}};
struct obj_affected_type WarriorModifiers[] = {{ -1, -1}};
struct extra_affects_type ThiefAffects[] = {{ -1, -1}};
struct obj_affected_type ThiefModifiers[] = {{ -1, -1}};
struct extra_affects_type RangerAffects[] = {{ -1, -1}};
struct obj_affected_type RangerModifiers[] = {{ -1, -1}};

struct class_app_type class_app[NUM_CLASSES] = { {5, 33, 5, 5, 20, (struct extra_affects_type *)&MageAffects, (struct obj_affected_type *)&MageModifiers},
    {2, 50, 8, 10, 22, (struct extra_affects_type *)&ThiefAffects, (struct obj_affected_type *)&ThiefModifiers},
    {1, 70, 15, 15, 25, (struct extra_affects_type *)&WarriorAffects, (struct obj_affected_type *)&WarriorModifiers},
    {3, 60, 10, 12, 23, (struct extra_affects_type *)&RangerAffects, (struct obj_affected_type *)&RangerModifiers},
};

struct extra_affects_type HumansAffects[] = {{ -1, -1}};
struct obj_affected_type HumansModifiers[] = {{ -1, -1}};
struct skill_modify_type HumansSkills[] = {{ -1, -1}};

struct extra_affects_type OrcAffects[] = {{AFF_INFRAVISION, 1},
    { -1, -1}
};
struct obj_affected_type OrcModifiers[] = {{ -1, -1}};
struct skill_modify_type OrcSkills[] = {{ -1, -1}};

struct extra_affects_type GnomeAffects[] = {{AFF_INFRAVISION, 1},
    { -1, -1}
};
struct obj_affected_type GnomeModifiers[] = {{ -1, -1}};
struct skill_modify_type GnomeSkills[] = {{ -1, -1}};

struct extra_affects_type ElvesAffects[] = {{AFF_INFRAVISION, 1},
    { -1, -1}
};
struct obj_affected_type ElvesModifiers[] = {{ -1, -1}};
struct skill_modify_type ElvesSkills[] = {{ -1, -1}};

struct extra_affects_type DrouAffects[] = {{AFF_DARKVISION, 1},
    { -1, -1}
};
struct obj_affected_type DrouModifiers[] = {{ -1, -1}};
struct skill_modify_type DrouSkills[] = {
    {SKILL_HIDE, 15},
    {SKILL_SNEAK, 15},
    {SKILL_DEVIATE, 15},
    { -1, -1}
};

struct extra_affects_type HalfElvesAffects[] = {{AFF_INFRAVISION, 1},
    { -1, -1}
};
struct obj_affected_type HalfElvesModifiers[] = {{ -1, -1}};
struct skill_modify_type HalfElvesSkills[] = {
    {SKILL_CHARM, 10},
    {SKILL_TRACK, 10},
    {SKILL_HIDETRACK, 10},
    {SKILL_CAMOUFLAGE, 10},
    {SKILL_SATTACK, 25},
    { -1, -1}
};

struct extra_affects_type BariaurAffects[] = {{AFF_INFRAVISION, 1},
    { -1, -1}
};
struct obj_affected_type BariaurModifiers[] = {{ -1, -1}};
struct skill_modify_type BariaurSkills[] = {{ -1, -1}};

struct extra_affects_type TieflingAffects[] = {{AFF_INFRAVISION, 1},
    { -1, -1}
};
struct obj_affected_type TieflingModifiers[] = {{ -1, -1}};
struct skill_modify_type TieflingSkills[] = {
    {SKILL_SNEAK, 10},
    {SKILL_HIDE, 10},
    {SKILL_LOOK_HIDE, 10},
    {SKILL_CAMOUFLAGE, 10},
    { -1, -1}
};

struct extra_affects_type AasimarAffects[] = {{AFF_INFRAVISION, 1},
    { -1, -1}
};
struct obj_affected_type AasimarModifiers[] = {{ -1, -1}};
struct skill_modify_type AasimarSkills[] = {{ -1, -1}};

struct extra_affects_type AnimalAffects[] = {{AFF_INFRAVISION, 1},
    { -1, -1}
};
struct obj_affected_type AnimalModifiers[] = {{ -1, -1}};
struct skill_modify_type AnimalSkills[] = {{ -1, -1}};

struct extra_affects_type DragonAffects[] = {{AFF_DARKVISION, 1},
    { -1, -1}
};
struct obj_affected_type DragonModifiers[] = {{ -1, -1}};
struct skill_modify_type DragonSkills[] = {{ -1, -1}};

struct extra_affects_type HumanoidAffects[] = {{ -1, -1}};
struct obj_affected_type HumanoidModifiers[] = {{ -1, -1}};
struct skill_modify_type HumanoidSkills[] = {{ -1, -1}};

struct extra_affects_type GenasiAffects[] = {{AFF_INFRAVISION, 1},
    { -1, -1}
};
struct obj_affected_type GenasiModifiers[] = {{ -1, -1}};
struct skill_modify_type GenasiSkills[] = {{ -1, -1}};



struct race_app_type race_app[NUM_RACES] = { {(struct extra_affects_type *)&HumansAffects, (struct obj_affected_type *)&HumansModifiers, (struct skill_modify_type *)&HumansSkills},
    {(struct extra_affects_type *)&OrcAffects, (struct obj_affected_type *)&OrcModifiers, (struct skill_modify_type *)&OrcSkills},
    {(struct extra_affects_type *)&GnomeAffects, (struct obj_affected_type *)&GnomeModifiers, (struct skill_modify_type *)&GnomeSkills},
    {(struct extra_affects_type *)&ElvesAffects, (struct obj_affected_type *)&ElvesModifiers, (struct skill_modify_type *)&ElvesSkills},
    {(struct extra_affects_type *)&HalfElvesAffects, (struct obj_affected_type *)&HalfElvesModifiers, (struct skill_modify_type *)&HalfElvesSkills},
    {(struct extra_affects_type *)&BariaurAffects, (struct obj_affected_type *)&BariaurModifiers, (struct skill_modify_type *)&BariaurSkills},
    {(struct extra_affects_type *)&TieflingAffects, (struct obj_affected_type *)&TieflingModifiers, (struct skill_modify_type *)&TieflingSkills},
    {(struct extra_affects_type *)&AasimarAffects, (struct obj_affected_type *)&AasimarModifiers, (struct skill_modify_type *)&AasimarSkills},
    {(struct extra_affects_type *)&DrouAffects, (struct obj_affected_type *)&DrouModifiers, (struct skill_modify_type *)&DrouSkills},
    {(struct extra_affects_type *)&AnimalAffects, (struct obj_affected_type *)&AnimalModifiers, (struct skill_modify_type *)&AnimalSkills},
    {(struct extra_affects_type *)&DragonAffects, (struct obj_affected_type *)&DragonModifiers, (struct skill_modify_type *)&DragonSkills},
    {(struct extra_affects_type *)&HumanoidAffects, (struct obj_affected_type *)&HumanoidModifiers, (struct skill_modify_type *)&HumanoidSkills},
    {(struct extra_affects_type *)&GenasiAffects, (struct obj_affected_type *)&GenasiModifiers, (struct skill_modify_type *)&GenasiSkills}
};

const char *spell_wear_off_msg[LAST_USED_SPELL+1] = { "RESERVED DB.C",             /* 0 */
        "Ваше тело перестало быть очень прочным.",   /* 1 */
        "!Teleport!",
        "Вы почувствовали себя менее доблестно.",
        "Вы вновь можете видеть.",
        "!Burning Hands!",            /* 5 */
        "!Call Lightning",
        "Вы подчиняетесь теперь только себе.",
        "Силы вернулись к Вам.",
        "!Clone!",
        "!Color Spray!",              /* 10 */
        "!Control Weather!",
        "!Create Food!",
        "!Create Water!",
        "!Cure Blind!",
        "!Cure Critic!",              /* 15 */
        "!Cure Light!",
        "Вы почувствовали себя более уверенно.",
        "Вы более не можете определять наклонности.",
        "Вы не в состоянии больше видеть невидимых.",
        "Вы не в состоянии более определять магию.",/* 20 */
        "Вы не в состоянии более определять яды.",
        "!Dispel Evil!",
        "!Earthquake!",
        "!Enchant Weapon!",
        "!Energy Drain!",             /* 25 */
        "!Fireball!",
        "!Harm!",
        "!Heal!",
        "Вы вновь видимы.",
        "!Lightning Bolt!",           /* 30 */
        "!Locate object!",
        "!Magic Missile!",
        "В Вашей крови ни осталось ни капельки яда.",
        "Вы вновь ощущаете страх перед тьмой.",
        "!Remove Curse!",             /* 35 */
        "Белая аура вокруг Вашего тела угасла.",
        "!Shocking Grasp!",
        "Вы чувствуете себя выспавшимся.",
        "Вы чувствуете себя немного слабее.",
        "!Summon!",                   /* 40 */
        "!Ventriloquate!",
        "!Word of Recall!",
        "!Remove Poison!",
        "Вы больше не можете чувствовать жизнь.",
        "!Animate Dead!",             /* 45 */
        "!Dispel Good!",
        "!Group Armor!",
        "!Group Heal!",
        "!Group Recall!",
        "Вы больше не можете видеть ночью.", /* 50 */
        "Вы больше не можете ходить по воде.",
        "!SPELL CURE SERIOUS!",
        "!SPELL GROUP STRENGTH!",
        "К Вам вернулась способность двигаться.",
        "!SPELL POWER HOLD!", /* 55 */
        "!SPELL MASS HOLD!",
        "Вы приземлились на землю.",
        "!SPELL MASS FLY!",
        "Вы опять можете сбежать с поля боя.",
        "!SPELL CREATE LIGHT!",   /* 60 */
        "Облако тьмы, окружающее Вас, спало.",
        "Ваша кожа вновь стала мягкой и бархатистой.",
        "Ваши очертания приобрели отчетливость.",
        "Теперь Вы можете болтать, все что думаете.",
        "Ваше тело перестало светиться.",     /* 65 */
        "!SPELL CHAIN LIGHTNING!",
        "!SPELL FIREBLAST!",
        "!SPELL IMPLOSION!",
        "Силы вернулись к Вам.",
        "!SPELL GROUP INVISIBLE!", /* 70 */
        "Вы стали более восприимчивы к магии.",
        "!SPELL ACID!",
        "!SPELL REPAIR!",
        "Ваши размеры стали прежними.",
        "!SPELL FEAR!",                 /* 75 */
        "!SPELL SACRIFICE!",
        "Магическая сеть, покрывавшая Вас, исчезла.",
        "Вы перестали мигать.",
        "!SPELL REMOVE HOLD!",
        "Вы стали вновь похожи сами на себя.",  /* 80 */
        "!SPELL POWER BLINDNESS!",
        "!SPELL MASS BLINDNESS!",
        "!SPELL POWER SIELENCE!",
        "!SPELL EXTRA HITS!",
        "!SPELL RESSURECTION!", /* 85 */
        "!SPELL PROLONGATION!",
        "!SPELL FORBIDDEN!",
        "!SPELL MASS SIELENCE!",
        "!SPELL REMOVE SIELENCE!",
        "!SPELL DAMAGE LIGHT!", /* 90 */
        "!SPELL DAMAGE SERIOUS!",
        "!SPELL DAMAGE CRITIC!",
        "!SPELL MASS CURSE!",
        "!SPELL ARMAGEDDON!",
        "!SPELL GROUP FLY!", /* 95 */
        "!SPELL GROUP BLESS!",
        "!SPELL REFRESH!",
        "!SPELL STUNNING!",
        "Вы стали заметны окружающим.",
        "",     /* 100  sneak */
        "У Вас началось похмелье.",
        "Похмелье прошло.",
        "!SPELL FULL!",
        "!CONE OF HOLD!",
        "К Вам вернулась способность нормально сражаться.", /* 105 */
        "Ваши кровоточащие раны затянулись.",
        "Вы успокоились.",
        "Вы более неспособны дышать водой.",
        "Медлительность исчезла.",
        "Вы стали более медлительны.",                      /* 110 */
        "!SPELL MASS SLOW!",
        "!SPELL MASS HASTE!",
        "Голубой кокон вокруг Вашего тела угас.",
        "Лихорадка прекратилась.",
        "!SPELL CURE PLAQUE!",                                                         /* 115 */
        "Вы стали менее внимательны.",
        "Вы утратили расположение Богов.",
        "Ваш воздушный щит исчез.",
        "!PORTAL!",
        "!DISPELL MAGIC!",                                  /* 120 */                                 /* 120 */
        "!SUMMON KEEPER!",
        "Живительная сила покинула Вас",
        "!CREATE WEAPON!",
        "Огненный щит вокруг Вашего тела исчез.",
        "!RELOCATE!",                                                                         /* 125 */
        "!SUMMON FIREKEEPER!",
        "Ледяной щит вокруг Вашего тела исчез.",
        "!ICESTORM!",
        "Ваши размеры вновь стали прежними.",
        "!SHINE LIGHT!",                                  /* 130 */
        "Безумие боя отпустило Вас.",
        "Вы вновь чувствительны к магическим поражениям.",
        "Ваши контуры перечтали светиться.",
        "!VACUUM!",
        "!METEOR STORM!",
        "Ваши руки стали обычными руками.",
        "Ваш разум просветлел.",
        "Призматическая аура вокруг Вашего тела угасла.",
        "Силы зла оставили Вас.",
        "Воздушная аура вокруг Вас исчезла.",
        "Огненная аура вокруг Вас исчезла.",
        "Ледяная аура вокруг Вас исчезла.",
        "Каменный щит вокруг Вас растаял.",
        "Каменная аура вокруг Вас исчезла.",
        "Ваши глаза потускнели.",
        "Тьма окружающая Вас, растаяла."
                                                    };




int wear_bitvectors[] = {
    ITEM_WEAR_TAKE,  ITEM_WEAR_FINGER, ITEM_WEAR_FINGER, ITEM_WEAR_FACE,
    ITEM_WEAR_EARS,  ITEM_WEAR_EARS,   ITEM_WEAR_NECK,
    ITEM_WEAR_NECK,  ITEM_WEAR_BODY,   ITEM_WEAR_HEAD,   ITEM_WEAR_LEGS,
    ITEM_WEAR_FEET,  ITEM_WEAR_HANDS,  ITEM_WEAR_ARMS,   ITEM_WEAR_SHIELD,
    ITEM_WEAR_ABOUT, ITEM_WEAR_WAIST,  ITEM_WEAR_WRIST,  ITEM_WEAR_WRIST,
    ITEM_WEAR_WIELD, ITEM_WEAR_TAKE,   ITEM_WEAR_BOTHS,  ITEM_WEAR_TAIL, ITEM_WEAR_QUIVER
};

int movement_loss[] = {
    1,    /* Inside     */
    1,    /* City       */
    2,    /* Field      */
    4,    /* Forest     */
    5,    /* Hills      */
    7,    /* Mountains  */
    8,    /* Big Mountains */
    4,    /* Swimming   */
    1,    /* Unswimable */
    1,    /* Flying     */
    3,    /* Underwater */
    1,    /* Secret     */
    1,    /* Пропасть   */
    0, 0, 0, 0, 0, 0, 0, 0,
    3,    /* Field snow */
    4,    /* Field water */
    4,    /* Forest snow */
    5,    /* Forest water */
    5,    /* Hills snow */
    6,    /* Hills water */
    8,    /* Mountains snow */
    10,   /* Big Mountains snow */
    2,    /* THIN ice */
    2,    /* NORMAL ice */
    2
};

/* Not used in sprinttype(). */
const char *weekdays[] = { "День Леди",
                           "День Фактола",
                           "День Третий",
                           "День Четвертый",
                           "День Пятый",
                           "День Шестой",
                           "День Седьмой"
                         };


/* Not used in sprinttype(). */
const char *month_name[] = { "Регул",
                             "Аккордант",
                             "Ретрибатус",
                             "Нарцисс",
                             "Тифинг",
                             "Саворас",
                             "Пивот",
                             "Катеоцисм",
                             "Сакрилегион",
                             "Нихилум",
                             "Мортис",
                             "Декадре",
                             "Каприциоус",
                             "Лигучейм"
                           };



const char *weapon_affects[] = { "слепота",   /* 0 */
                                 "невидимость",
                                 "опр.наклонностей",
                                 "опр.невидимости",
                                 "опр.магии",
                                 "опр.жизни",
                                 "водохождение",
                                 "освящение",
                                 "проклятие",
                                 "инфравидение",
                                 "яд",         /* 10 */
                                 "защита.от.тьмы",
                                 "защита.от.света",
                                 "сон",
                                 "не.выследить",
                                 "доблесть",
                                 "подкрадывание",
                                 "спрятаться",
                                 "оцепенение",
                                 "полет",
                                 "молчание",            /* 20 */
                                 "настороженность",
                                 "мигание",
                                 "не.сбежать",
                                 "свет",
                                 "освещение",
                                 "тьма",
                                 "опр.яда",
                                 "медлительность",
                                 "ускорение",
                                 "\n",                          /* 30 */
                                 "дыхание.водой",
                                 "кровотечение",
                                 "маскировка",
                                 "защита.богов",
                                 "воздушный.щит",
                                 "огненный.щит",
                                 "ледяной.щит",
                                 "зеркало.магии",
                                 "каменная.рука",
                                 "призматическая.аура",
                                 "воздушная.аура",
                                 "огненная.аура",
                                 "ледяная.аура",
                                 "каменный.щит",
                                 "каменная.аура",
                                 "левитация",
                                 "\n",
                                 "\n",
                                 "\n"
                               };


// Fields: whom location modifier bitvector battleflag

const char *weather_mess[2][8] = {
    {
        "Небо над городом слегка посветлело. Наступило утро.",
        "Сияние неба заметно усилилось. Наступил день.",
        "Сияние неба слегка потускнело. Сгущаются сумерки.",
        "Небесное сияние, мерцая, погасло. Наступила ночь.",
        "Серое облако смога повисло над городом.",
        "Густой туман окутал городские улицы.",
        "Грязно-желтые тучи сгустились над городом.",
        "Тучи постепенно рассеялись, явив взору противоположный край города."
    },

    {
        "Луч солнца показался на востоке.", //0
        "Начался день.",
        "Солнце медленно опустилось за горизонт.",
        "Наступила ночь.",
        "На небе собрались тучи.",
        "Тучи рассеялись.", //5
        "Ветер разогнал тучи.",
        "Ясно."
    }
};

const int max_damage[] = {
    1,
    2,    //   5%
    8,    //  10%
    14,   //  15%
    18,   //  20%
    22,   //  25%
    24,   //  30%  *
    26,   //  35%
    30,   //  40%
    36,   //  45%
    40,   //  50% *
    46,   //  55%
    52,   //  60%
    58,   //  65%
    66,   //  70% *
    78,   //  75%
    88,   //  80% *
    100,   //  85%
    120,   //  90% *
    145,   //  95%
    170,   // 100%
    200,  // 105%
    230,  // 110%
    260,  // 115%
    300,  // 120%
    300,  // 125%
    300,  // 130%
    300,  // 135%
    300,  // 140%
    300,  // 145%
    300   // 150%
};

const int max_armor[] = {
    0,
    1, //1
    2,
    3,
    4,
    6, //5
    8,
    10,
    11,
    12,
    14, //10
    18,
    22,
    26,
    30,
    34, //15
    38,
    42,
    46,
    50,
    54, //20
    60,
    66,
    72,
    78,
    86, //25
    92,
    100,
    110,
    120,
    130, //30
    140,
    160,
    170,
    180,
    190
};

struct drink_conds_data thirst_race[NUM_RACES] = {
    {2160,  -1},   // человек
    {2880,  -1},   // орк
    {2880,  -1},   // гном
    {1440,  -1},   // эльф
    {2160,  -1},   // полуэльф
    {3600,  -1},   // бариаур
    {1800,  -1},   // тифлинг
    {1800,  -1},   // эйзимар
    {1440,  -1},   // эльф
    {3600,  -1},   // животное
    {7200,  -1},   // дракон
    {2160,  -1},   // гуманоид
    {1800,  -1}    // генази
};

struct drink_conds_data drunk_race[NUM_RACES] = {
    {1000,  -1},   // человек
    {1400,  -1},   // орк
    {1400,  -1},   // гном
    { 800,  -1},   // эльф
    {1000,  -1},   // полуэльф
    {2000,  -1},   // бариаур
    {1100,  -1},   // тифлинг
    { 800,  -1},   // эйзимар
    { 800,  -1},   // эльф
    {2000,  -1},   // животное
    {7200,  -1},   // дракон
    {1000,  -1},   // гуманоид
    { 800,  -1}    // генази
};

struct drink_conds_data full_race[NUM_RACES] = {
    {2160,  -1},   // человек
    {2880,  -1},   // орк
    {2880,  -1},   // гном
    {1440,  -1},   // эльф
    {2160,  -1},   // полуэльф
    {3600,  -1},   // бариаур
    {1800,  -1},   // тифлинг
    {1800,  -1},   // эйзимар
    {1440,  -1},   // эльф
    {3600,  -1},   // животное
    {7200,  -1},   // дракон
    {2160,  -1},   // гуманоид
    {1800,  -1}    // генази
};

struct drink_conds_data sleep_race[NUM_RACES] = {
    {36,  -1},   // человек
    {48,  -1},   // орк
    {48,  -1},   // гном
    {24,  -1},   // эльф
    {36,  -1},   // полуэльф
    {60,  -1},   // бариаур
    {30,  -1},   // тифлинг
    {30,  -1},   // эйзимар
    {24,  -1},   // эльф
    {60,  -1},   // животное
    {120, -1},   // дракон
    {36,  -1},   // гуманоид
    {60,  -1}    // генази
};

const char *attack_name[] = {
    "ударил",
    "ободрал",
    "хлестнул",
    "рубанул",
    "укусил",
    "огрел",
    "сокрушил",
    "резанул",
    "оцарапал",
    "подстрелил",
    "пырнул",
    "уколол",
    "ткнул",
    "лягнул",
    "боднул",
    "клюнул"
};

struct attack_hit_type attack_hit_text[] = {
    {"ударил",    "ударить" , "ударив"},  /* 0 */
    {"ободрал",   "ободрать", "ободрав"},
    {"хлестнул",  "хлестнуть", "хлестнув"},
    {"рубанул",   "рубануть", "рубанув"},
    {"укусил",    "укусить", "укусив"},
    {"огрел",     "огреть", "огрев"}, /* 5 */
    {"сокрушил",  "сокрушить", "сокрушив"},
    {"резанул",   "резануть", "резанув"},
    {"оцарапал",  "оцарапать", "оцарапав"},
    {"подстрелил", "подстрелить", "подстрелив"},
    {"пырнул",    "пырнуть", "пырнув"}, /* 10 */
    {"уколол",    "уколоть", "уколов"},
    {"ткнул",     "ткнуть", "ткнув"},
    {"лягнул",    "лягнуть", "лягнув"},
    {"боднул",    "боднуть", "боднув"},
    {"клюнул",    "клюнуть", "клюнув"},
    {"*", "*", "*"},
    {"*", "*", "*"},
    {"*", "*", "*"},
    {"*", "*", "*"}
};

const char *sphere_names[] = {
//маги
    "школ(а) зачарования",
    "школ(а) прорицания",
    "школ(а) некромантии",
    "школ(а) превращения",
    "школ(а) проявления",
    "школ(а) вызывания",
    "школ(а) иллюзии",
    "школ(а) отречения",
//жрецы
    "сфер(а) добра",
    "сфер(а) исцеления",
    "сфер(а) света",
    "сфер(а) солнца",
    "сфер(а) войны",
    "сфер(а) защиты",
    "сфер(а) природы",
    "сфер(а) удачи",
    "сфер(а) путешествия",
    "сфер(а) силы",
    "сфер(а) магии",
    "сфер(а) зла",
    "сфер(а) смерти",
    "сфер(а) разрушения"
};

const char *sphere_name[] = {
//маги
    "школа зачарования",
    "школа прорицания",
    "школа некромантии",
    "школа превращения",
    "школа проявления",
    "школа вызывания",
    "школа иллюзии",
    "школа отречения",
//жрецы
    "сфера добра",
    "сфера исцеления",
    "сфера света",
    "сфера солнца",
    "сфера войны",
    "сфера защиты",
    "сфера природы",
    "сфера удачи",
    "сфера путешествия",
    "сфера силы",
    "сфера магии",
    "сфера зла",
    "сфера смерти",
    "сфера разрушения"
};

const char *sphere_name5[] = {
//маги
    "школе зачарования",
    "школе прорицания",
    "школе некромантии",
    "школе превращения",
    "школе проявления",
    "школе вызывания",
    "школе иллюзии",
    "школе отречения",
//жрецы
    "сфере добра",
    "сфере исцеления",
    "сфере света",
    "сфере солнца",
    "сфере войны",
    "сфере защиты",
    "сфере природы",
    "сфере удачи",
    "сфере путешествия",
    "сфере силы",
    "сфере магии",
    "сфере зла",
    "сфере смерти",
    "сфере разрушения"
};

const char *obj_temp[] = {
    "ледяное",
    "очень холодное",
    "холодное",
    "прохладное",
    "нормальная",
    "теплое",
    "горячее",
    "очень горячее",
    "раскаленное"
};

const int fire_damage_obj[] = {
    0, //MAT_NONE
    1, //MAT_CUPRUM
    1, //MAT_BRONZE
    1, //MAT_IRON
    1, //MAT_STEEL
    1, //MAT_SILVER
    1, //MAT_GOLD
    1, //MAT_PLATINUM
    1, //MAT_TITANUM
    1, //MAT_ADAMANT
    1, //MAT_MITHRIL
    20, //MAT_PLASTIC
    5, //MAT_CRYSTALL
    25, //MAT_WOOD
    20, //MAT_SUPERWOOD
    2, //MAT_FARFOR
    3, //MAT_GLASS
    1, //MAT_STONE
    1, //MAT_ROCK
    30, //MAT_SKIN
    50, //MAT_ORGANIC
    0, //MAT_CERAMIC
    50, //MAT_MATERIA
    100, //MAT_PAPER
    10, //MAT_BONE
    100, //MAT_GAZ
    1, //MAT_DIAMOND
    1, //MAT_METAL
    100 //MAT_PERGAMENT
};

const int move_wait_race[NUM_RACES] = {
    4, //человек 0
    6, // орк    1
    6, // гном   2
    4, // эльф   3
    4, // полуэльф 4
    6, // бариаур 5
    2, // тифлинг   6
    4, // эйзимар   7
    4, // эльф   3
    4, // животное  8
    6, // дракон    9
    4, // гуманоид  10
    2 // генази     11
};

const char *room_affects[] = {
    "пусто",
    "проклято",
    "свято",
    "поле антимагии",
    "псфера огонь",
    "псфера холод",
    "псфера электро",
    "псфера яд",
    "псфера удары",
    "призматическая сфера",
    "нет",
    "преддверие смерти",
    "лечение",
    "ядовитое облако",
    "\r\n",
    "\r\n",
    "\r\n"
};

const char *eyes_color[] = {
    "неизвестные",
    "черные",
    "желтые",
    "красные",
    "зеленые",
    "серые",
    "синие",
    "голубые",
    "карие",
    "серебристые",
    "золотистые"
};

/* Указание лечащих заклинаний */
const int spells_health[] = {
    SPELL_HEAL,
    SPELL_CURE_CRITICAL,
    SPELL_HEAL_MASS,
    SPELL_CURE,
    SPELL_CURE_MASS,
    -1
};

/* Указание защитных заклинаний */
const int spells_defence[] = {
    SPELL_STONE_SKIN,
    SPELL_FIRE_SHIELD,
    SPELL_PROTECT_FROM_EVIL,
    SPELL_PROTECT_FROM_GOOD,
//SPELL_REPULSION,
    SPELL_FREE_MOVES,
// SPELL_MAGIC_IMMUNITY,
    -1
};

const int spells_defence_war[] = {
    SPELL_HOLY_AURA,
    SPELL_UNHOLY_AURA,
    SPELL_PRISMA_SPHERE,
    SPELL_SANCTUARY,
    SPELL_SPIRIT_WEAPON,
// SPELL_NOMAGIC_FIELD,
    SPELL_ENTROPIC_SHIELD,
    SPELL_SUMMON_ANGEL,
    SPELL_SUMMON_MONSTER_2,
    SPELL_MAGIC_IMMUNITY,
    SPELL_STONE_SKIN,
    SPELL_BLADE_BARRIER,
    SPELL_FIRE_SHIELD,
    -1
};

/* Указание полезных эффектов */
const int spells_helped[] = {
    SPELL_RIGHTEOUS_MIGHT,
    SPELL_DIVINE_POWER,
    SPELL_SUNBEAM,
    SPELL_BULL_STRENGH,
    SPELL_DESECRATE,
    SPELL_AID,
    -1
};

/* Указание вредных эффектов */
const int spells_harmed[] = {
    SPELL_POWER_WORD_STUNE,
    SPELL_POWER_WORD_BLIND,
    SPELL_EVIL_FATE,
// SPELL_HEAT_METALL,
    -1
};


/* Указание повреждающих заклинаний */
const int spells_damages[] = {
// SPELL_POWER_WORD_KILL,
// SPELL_BLASPHEMY,
    SPELL_CRUSHING_FIST,
    SPELL_CLENCHED_FIST,
    SPELL_GRASPING_HAND,
    SPELL_FLAME_STRIKE,
    SPELL_FLAME_STRIKE_WAR,
    SPELL_HOLY_WORD,
    SPELL_SUNBURST,
    SPELL_UNHOLY_BLIGHT,
    SPELL_SEARING_LIGHT,
    SPELL_HOLY_SMITE,
    -1
};


const int quality_at_durab[] = {
    0, //пустое значение
    1, //1
    3, //2
    6, //3
    8, //4
    10, //5
    12, //6
    13, //7
    15, //8
    20 //9
};

const int quality_at_ac[] = {
    0, //пустое значение
    25,
    50,
    75,
    90,
    100,
    110,
    125,
    140,
    160

};

const int quality_at_cost[] = {
    0, //пустое значение
    60,
    75,
    80,
    90,
    100,
    120,
    145,
    180,
    240
};

const char *t_zone[] = {
    "  служебная ", //0
    "  начальные ", //1
    "  маленькие ", //2
    "   средние  ", //3
    "   высокие  ", //4
    "сверхвысокие", //5
    "    любые   "  //6
};


const int cost_hotel[] = {
    0,
    10,       //1й класс
    40,       //2й
    100,      //3й
    500,      //4й
    1000      //5й
};

const int max_obj_cost[] = {
    50,
    500,        //1й класс
    1000,        //2й
    5000,       //3й
    15000,      //4й
    999999      //5й
};

const int max_obj_count[] = {
    8,
    15,        //1й класс
    25,       //2й
    35,       //3й
    50,      //4й
    60       //5й
};

const char *body_name[] = {
    "нет",
    "голов(а)",
    "тел(о)",
    "лиц(о)",
    "ше(я)",
    "крыл(о)",
    "рук(а,и,е,у,ой,е)",
    "лап(а)",
    "щупальц(е,а,у,е,ем,е)",
    "живот()",
    "спин(а)",
    "хвост()",
    "но(га)",
    "туловищ(е,а,у,е,ем,е)"
};

const int wpos_to_wear[] = {
    WEAR_BODY, //НЕТ 0
    WEAR_BODY, //ТУЛОВИЩЕ 1
    WEAR_HEAD, //ГОЛОВА   2
    WEAR_FACE, //ЛИЦО     3
    WEAR_NECK_1, //ШЕЯ      4
    WEAR_ARMS, //ВЕРХНИЕ_РУКИ 5
    WEAR_ARMS, //НИЖНИЕ_РУКИ  6
    WEAR_LEGS, //ПЕРЕДНИЕ_НОГИ 7
    WEAR_LEGS, //ЗАДНИЕ_НОГИ 8
    WEAR_ABOUT, //СПИНА 9
    WEAR_TAIL, //ХВОСТ 10
    WEAR_BODY, //КРЫЛЬЯ 11
    WEAR_WAIST, //ЖИВОТ  12
    WEAR_FEET, //СТУПНИ 13
    WEAR_HANDS //КИСТИ  14
};

const int wear_to_wpos[] = {
    WPOS_NONE, //WEAR_LIGHT
    WPOS_NONE, //WEAR_FINGER_R
    WPOS_NONE, //WEAR_FINGER_L
    WPOS_FACE, //WEAR_FACE
    WPOS_FACE, //WEAR_EAR_R
    WPOS_FACE, //WEAR_EAR_L
    WPOS_NECK, //WEAR_NECK_1
    WPOS_NECK, //WEAR_NECK_2
    WPOS_BODY, //WEAR_BODY
    WPOS_HEAD, //WEAR_HEAD
    WPOS_FRONT_LEGS, //WEAR_LEGS
    WPOS_BACK_LEGS, //WEAR_FEET
    WPOS_BOT_ARMS, //WEAR_HANDS
    WPOS_TOP_ARMS, //WEAR_ARMS
    WPOS_NONE, //WEAR_SHIELD
    WPOS_ABOUT, //WEAR_ABOUT
    WPOS_WAIST, //WEAR_WAIST
    WPOS_NONE, //WEAR_WRIST_R
    WPOS_NONE, //WEAR_WRIST_L
    WPOS_NONE, //WEAR_WIELD
    WPOS_NONE, //WEAR_HOLD
    WPOS_NONE, //WEAR_BOTHS
    WPOS_TAIL, //WEAR_TAIL
    WPOS_NONE //WEAR_QUIVER
};

const char *damage_name[] = {
    "нет",
    "режущее",
    "колющее",
    "ударное",
    "огонь",
    "холод",
    "электро",
    "кислота",
    "яд",
    "позитив",
    "негатив"
};

const float mob_to_arm[NUM_RACES][NUM_CLASSES] = {
//
    { 1.8, 1.5, 2.5, 2.0, 2.3, 1.8, 1.5 }, //0
    { 1.8, 1.7, 2.7, 2.2, 2.5, 2.0, 1.7 },
    { 1.8, 1.8, 2.8, 2.3, 2.6, 2.1, 1.8 },
    { 1.8, 1.2, 2.2, 1.7, 2.0, 1.5, 1.2 },
    { 1.8, 1.4, 2.4, 1.9, 2.2, 1.7, 1.4 },
    { 1.8, 1.7, 2.7, 2.2, 2.5, 2.0, 1.7 }, //5
    { 1.8, 1.4, 2.4, 1.9, 2.2, 1.7, 1.4 },
    { 1.8, 1.5, 2.5, 2.0, 2.3, 1.8, 1.5 },
    { 1.8, 1.5, 2.5, 2.0, 2.3, 1.8, 1.5 },
    { 3.0, 3.0, 3.0, 3.0, 3.0, 3.0, 3.0 },
    { 1.8, 1.5, 2.5, 2.0, 2.3, 1.8, 1.5 }, //10
    { 1.8, 1.3, 2.3, 1.8, 2.1, 1.6, 1.3 },
    { 1.8, 1.1, 2.1, 1.6, 1.9, 1.4, 1.1 },
    { 1.8, 1.3, 2.3, 1.8, 2.1, 1.6, 1.3 },
    { 1.8, 1.6, 2.6, 2.1, 2.4, 1.9, 1.6 },
    { 1.8, 1.3, 2.3, 1.8, 2.1, 1.6, 1.3 }, //15
    { 1.8, 1.6, 2.6, 2.1, 2.4, 1.9, 1.6 },
    { 1.8, 1.7, 2.7, 2.2, 2.5, 2.0, 1.7 },
    { 1.8, 1.7, 2.7, 2.2, 2.5, 2.0, 1.7 },
    { 1.8, 1.1, 2.1, 1.6, 1.9, 1.4, 1.1 },
    { 1.8, 1.6, 2.6, 2.1, 2.4, 1.9, 1.6 }, //20
    { 1.8, 1.3, 2.3, 1.8, 2.1, 1.6, 1.3 },
    { 1.8, 1.4, 2.4, 1.9, 2.2, 1.7, 1.4 },
    { 1.8, 1.5, 2.5, 2.0, 2.3, 1.8, 1.5 },
    { 1.8, 1.5, 2.5, 2.0, 2.3, 1.8, 1.5 },
    { 1.8, 1.5, 2.5, 2.0, 2.3, 1.8, 1.5 }, //25
    { 1.8, 1.3, 2.3, 1.8, 2.1, 1.6, 1.3 },
    { 1.8, 1.4, 2.4, 1.9, 2.2, 1.7, 1.4 },
    { 1.8, 1.5, 2.5, 2.0, 2.3, 1.8, 1.5 },
    { 1.8, 1.5, 2.5, 2.0, 2.3, 1.8, 1.5 },
    { 1.8, 1.5, 2.5, 2.0, 2.3, 1.8, 1.5 },  //30
    { 1.8, 1.5, 2.5, 2.0, 2.3, 1.8, 1.5 }
};

const char *saves_name[] = {
    "выносливость",
    "рефлекс",
    "воля",
    "огонь",
    "холод",
    "электричество",
    "кислота",
    "хаос",
    "порядок",
    "неизвестный",
    "позитив",
    "негатив",
    "неизвестный2",
    "яд"
};

const char *what_damage_type[] = {
    "нет",
    "режущее",
    "колющее",
    "ударное",
    "огонь",
    "холод",
    "электричество",
    "кислота",
    "яд",
    "позитив",
    "негатив",
    "\n"
};

const char *what_damage_type_eng[] = {
    "none",
    "slash",
    "pick",
    "hit",
    "fire",
    "cold",
    "electro",
    "acid",
    "poison",
    "positive",
    "nagatine",
    "\n"
};

const char *armor_class[] = {
    "нет",
    "легкий",
    "средний",
    "тяжелый",
    "одежда",
    "декоративный"
};

const char *missile_name[] = {
    "нет",
    "стрел(а)",
    "болт()",
    "ядр(о)"
};

const char *missiles_name[] = {
    "нет",
    "стрел(ы,*,ам,ы,ами,ах)",
    "болт(ы,ов,ам,ы,ами,ах)",
    "яд(ра,ер,рам,ра,ами,ах)"
};

//const struct new_flag clear_flags = { {0,0,0,0} };

const int learn_charm[][2] = {
    {SKILL_GUARD, 1},
    {SKILL_KICK, 15},
    {SKILL_RESCUE, 45},
    {SKILL_STUPOR, 60},
    {SKILL_BASH, 90},
    {SKILL_CRITIC, 100}
};

const char *action_name[] = {
    "повернуть",
    "нажать",
    "вставить",
    "соединить",
    "двигать",
    "крутить",
    "пробить",
    "забить",
    "разбить",
    "войти",
    "копать",
    "тянуть",
    "нырнуть",
    "звонить",
    "лезть",
    "спрыгнуть",
    "запрыгнуть",
    "сломать",
    "расколоть",
    "расчистить",
    "рыться",
    "стучать",
    "зацепиться",
    "окропить",
    "намазать",
    "рубить"
};

const char *tool_name[] = {
    "непонятно что",
    "отмычк(а)",
    "молоток()",
    "лопат(а)",
    "топор()",
    "пил(а)",
    "кирк(а)",
    "ножни(цы)",
    "шил(о)"
};


const float progress_skill[] = { 5, 8, 8, 9, 9, 10, 15, 20, 25, 30, 30, 35, 40, 45, 50, 52, 55, 57, 59, 60, 65, 70, 75, 78, 80, 85, 90, 95, 98, 100, 100 };
